In [5]:
import pandas as pd
df=pd.read_csv("emp.csv")
df

  name  age  salary dept gender
0  abc   20    5000  cse      f
1  def   22    3000  ece      m
2  ghi   23    4500  cse      m
3  jkl   26    5300  cse      f
4  mno   21    4200  ece      f
5  pqr   24    6000  cse      m
6  stu   30    3200  cse      m
7   vw   33    2500  ece      f
8  xyz   34    4400  cse      m

In [6]:
print(df.groupby(["gender"]).mean())

         age  salary
gender
f       25.0  4250.0
m       26.6  4220.0

In [7]:
a=df.groupby(["gender","dept"])
print(a.groups)

{('f', 'cse'): [0, 3], ('f', 'ece'): [4, 7], ('m', 'cse'): [2, 5, 6, 8], ('m', 'ece'): [1]}

In [8]:
print(df.groupby(["dept"]).mean())

            age       salary
dept
cse   26.166667  4733.333333
ece   25.333333  3233.333333

In [9]:
print(df.groupby(["dept"]).max())

     name  age  salary gender
dept
cse   xyz   34    6000      m
ece    vw   33    4200      m

In [10]:
print(df.groupby(["dept"]).min())

     name  age  salary gender
dept
cse   abc   20    3200      f
ece   def   21    2500      f

In [11]:
print(df.groupby("gender").groups)

{'f': [0, 3, 4, 7], 'm': [1, 2, 5, 6, 8]}

In [12]:
g=df.groupby(["gender"])
print(g)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001AB16833A30>

In [13]:
df["gender"].value_counts()

m    5
f    4
Name: gender, dtype: int64

In [14]:
df["name"].value_counts()

abc    1
def    1
ghi    1
jkl    1
mno    1
pqr    1
stu    1
vw     1
xyz    1
Name: name, dtype: int64

In [15]:
df["dept"].value_counts()

cse    6
ece    3
Name: dept, dtype: int64

In [16]:
print(df.groupby("gender").min())

       name  age  salary dept
gender
f       abc   20    2500  cse
m       def   22    3000  cse

In [17]:
df["exp"]=[3,4,5,3,4,5,1,5,4,]
df

  name  age  salary dept gender  exp
0  abc   20    5000  cse      f    3
1  def   22    3000  ece      m    4
2  ghi   23    4500  cse      m    5
3  jkl   26    5300  cse      f    3
4  mno   21    4200  ece      f    4
5  pqr   24    6000  cse      m    5
6  stu   30    3200  cse      m    1
7   vw   33    2500  ece      f    5
8  xyz   34    4400  cse      m    4

In [25]:
print(df.groupby("exp").sum())

     age  salary
exp
1     30    3200
3     46   10300
4     77   11600
5     80   13000

In [26]:
print(df.groupby("exp").min())

    name  age  salary dept gender
exp
1    stu   30    3200  cse      m
3    abc   20    5000  cse      f
4    def   21    3000  cse      f
5    ghi   23    2500  cse      f

In [27]:
print(df.groupby("salary").min())

       name  age dept gender  exp
salary
2500     vw   33  ece      f    5
3000    def   22  ece      m    4
3200    stu   30  cse      m    1
4200    mno   21  ece      f    4
4400    xyz   34  cse      m    4
4500    ghi   23  cse      m    5
5000    abc   20  cse      f    3
5300    jkl   26  cse      f    3
6000    pqr   24  cse      m    5

In [28]:
print(df.groupby("salary").max())

       name  age dept gender  exp
salary
2500     vw   33  ece      f    5
3000    def   22  ece      m    4
3200    stu   30  cse      m    1
4200    mno   21  ece      f    4
4400    xyz   34  cse      m    4
4500    ghi   23  cse      m    5
5000    abc   20  cse      f    3
5300    jkl   26  cse      f    3
6000    pqr   24  cse      m    5